<h2 style="color:purple; font-family:Courier New; font: bold" >Task No. 1</h2>

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 1</h4>

In [4]:
import pandas as pd
import numpy as np

In [5]:
dataset = pd.read_csv("Employee.csv")
dataset.shape
dataset.columns
dataset.dtypes

dataset.isnull().sum()

dataset.duplicated().sum()

np.int64(0)

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 2</h4>

In [20]:
dataset[["Name", "Age", "Salary"]]

        Name   Age   Salary
0      Emp_1  56.0  40575.0
1      Emp_2  46.0  58423.0
2      Emp_3  32.0      NaN
3      Emp_4  60.0  40497.0
4      Emp_5  25.0  83146.0
..       ...   ...      ...
195  Emp_196  49.0  50694.0
196  Emp_197   0.0  48953.0
197  Emp_198  41.0  68692.0
198  Emp_199  58.0  51790.0
199  Emp_200  29.0      NaN

[200 rows x 3 columns]

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 3</h4>

In [22]:
dataset.head(10)
dataset.tail(5)

,Employee_ID,Name,Age,Department,Salary,Joining_Date,Gender,Experience_Years,Performance_Score,Work_Location
195,196,Emp_196,49.0,Operations,50694.0,4/30/2031,Male,6,2.0,Remote
196,197,Emp_197,0.0,Marketing,48953.0,5/31/2031,Female,8,2.0,London
197,198,Emp_198,41.0,IT,68692.0,6/30/2031,F,21,1.0,New York
198,199,Emp_199,58.0,HR,51790.0,7/31/2031,Male,21,4.0,New York
199,200,Emp_200,29.0,IT,NaN,8/31/2031,Female,10,1.0,New York

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 4</h4>

In [25]:
dataset[(dataset["Age"].between(30, 40)) & (dataset["Department"] == "IT")]

,Employee_ID,Name,Age,Department,Salary,Joining_Date,Gender,Experience_Years,Performance_Score,Work_Location
2,3,Emp_3,32.0,IT,NaN,3/31/2015,Female,25,5.0,New York
75,76,Emp_76,32.0,IT,52839.0,4/30/2021,Male,16,3.0,New York
80,81,Emp_81,38.0,IT,55465.0,9/30/2021,Male,3,1.0,Remote
91,92,Emp_92,32.0,IT,66865.0,8/31/2022,Female,1,1.0,Berlin
141,142,Emp_142,32.0,IT,55442.0,10/31/2026,Male,22,2.0,Remote
145,146,Emp_146,30.0,IT,83268.0,2/28/2027,Female,28,2.0,New York
152,153,Emp_153,40.0,IT,82335.0,9/30/2027,Male,0,5.0,Remote

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 5</h4>

In [32]:
dataset[(dataset["Work_Location"] == "New York") & (dataset["Performance_Score"] > 4)][["Name", "Performance_Score"]]

        Name  Performance_Score
2      Emp_3                5.0
37    Emp_38                5.0
184  Emp_185                5.0

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 6</h4>

In [34]:
dataset.select_dtypes(include=["number"]).head(5)
dataset.select_dtypes(include=["number"]).tail(5)

     Employee_ID   Age   Salary  Experience_Years  Performance_Score
195          196  49.0  50694.0                 6                2.0
196          197   0.0  48953.0                 8                2.0
197          198  41.0  68692.0                21                1.0
198          199  58.0  51790.0                21                4.0
199          200  29.0      NaN                10                1.0

In [41]:
dataset.index

RangeIndex(start=0, stop=200, step=1)

<h4 style="color:blue; font-family:'Courier New'; font-weight:bold;">Part 7</h4>

In [6]:
dataset["Gender"] = dataset["Gender"].replace({"M": "Male", "F": "Female"})


dataset.loc[dataset["Age"] < 18, "Age"] = np.nan
dataset.loc[dataset["Age"] > 100, "Age"] = np.nan


dataset.loc[dataset["Salary"] < 20000, "Salary"] = np.nan


for col in ["Department", "Work_Location"]:
    dataset[col] = dataset[col].astype(str).str.strip().str.title()

print("Cleaned Dataset Sample:\n", dataset.head(10))

Cleaned Dataset Sample:
    Employee_ID    Name   Age  Department   Salary Joining_Date  Gender  \
0            1   Emp_1  56.0     Finance  40575.0    1/31/2015  Female
1            2   Emp_2  46.0          It  58423.0    2/28/2015    Male
2            3   Emp_3  32.0          It      NaN    3/31/2015  Female
3            4   Emp_4  60.0     Finance  40497.0    4/30/2015  Female
4            5   Emp_5  25.0          Hr  83146.0    5/31/2015    Male
5            6   Emp_6  38.0   Marketing  79848.0    6/30/2015    Male
6            7   Emp_7  56.0          It      NaN    7/31/2015    Male
7            8   Emp_8  36.0          Hr  53015.0    8/31/2015    Male
8            9   Emp_9  40.0     Finance  60877.0    9/30/2015  Female
9           10  Emp_10  28.0  Operations  95219.0   10/31/2015  Female

   Experience_Years  Performance_Score Work_Location
0                19                3.0         Tokyo
1                24                1.0        Remote
2                25                5.0      New York
3                10                4.0        Remote
4                 5                4.0        Remote
5                 1                4.0      New York
6                 6                3.0        Remote
7                17                4.0         Tokyo
8                26                3.0        Remote
9                 1                1.0         Tokyo